module.exports = {
    MENU: {
        CHOOSE_READY_DESIGN: '👕Выбрать готовый дизайн.🖼',
        CREATE_YOUR_OWN: '✍️Создать свой дизайн.📎',
        UPLOAD_DESIGN: 'Выложить дизайн',
        UPLOADED_DESIGNS: 'Дизайны выложенные вами',
        ACTIONS: {
            READY_DESIGN: 'cReady',
            YOUR_OWN: 'cOwn',
            UPLOAD_DESIGN: 'upl',
            UPLOADED_DESIGNS: 'upled',
            CHOOSE_UPLOADED_DESIGNS: 'cUpl'
        },
        CONTEXT: {
            CREATE_YOUR_OWN: '- Создайте свой дизайн на сайте.\n- Заскриншотьте дизайн.\n- Выложите скриншот',
            CHOOSE_READY_DESIGN: 'Выберите категорию',
            CHOOSE_DESIGN: 'Выберите Дизайн',
            SHOW_CHOSEN_DESIGN: 'Выбран дизайн🔼.\nНажмите 👕& 📐чтобы выбрать цвет и размер футболки',
            UPLOAD_DESIGN: 'Выложите фото в чат.',
        }
    },
    BUTTONS: {
        COMPLETE_ORDER: '🏁Завершить заказ ✔️',
        CREATE_YOUR_OWN_URL_NAME: 'Создать свой дизайн на сайте и заскриншотить',
        MAKE_PURCHASE: '🛒Сделать покупку',
        ADD_CONTACT: '☎️ Поделится своими данными для доставки 📍',
        ACTIONS: {
            MAKE_PURCHASE: 'cart',
            ADD_ADDRESS: 'loc',
            COMPLETE_ORDER: 'ord',
        }
    },
    CALLBACK_ANSWERS: {
        ADD_ADDRESS: 'Введите свой адрес в чат начиная со слова "Адрес"\nНапример "Адрес: Улица Вязова, дом 2, город Ташкент."\nИли же скиньте геолокацию прям в чат.',
        PIC_IS_NOT_UPLOADED: 'Вы пока не выложили фото',
        PIC_IS_NOT_UPLOADED_YET: 'футболки не выложено',
        UPLOAD_FRONT_DESIGN: 'Загрузите фото с передним дизайном в чат',
        UPLOAD_BACK_DESIGN: 'Загрузите фото с дизайном сзади футболки в чат',
        UPLOAD_SLEEVES_DESIGN: 'Загрузите фото с дизайном на рукоятках в чат',
    }
}